In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("student_dataset.csv")

In [3]:
df.head() #display top 5 elements of student dataset

   ID       Name  Age  Marks  Gender
0   1  Student_1   24     94    Male
1   2  Student_2   21     81  Female
2   3  Student_3   22     90    Male
3   4  Student_4   24     56  Female
4   5  Student_5   20     44  Female

In [4]:
df.tail() #display bottom 5 elements of student dataset

       ID          Name  Age  Marks  Gender
995   996   Student_996   23     82  Female
996   997   Student_997   18     73  Female
997   998   Student_998   24     96  Female
998   999   Student_999   21     65    Male
999  1000  Student_1000   23     80    Male

In [5]:
df.info() #display content of student dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      1000 non-null   int64
 1   Name    1000 non-null   object
 2   Age     1000 non-null   int64
 3   Marks   1000 non-null   int64
 4   Gender  1000 non-null   object
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

In [6]:
df.describe() #display statistical summary of student dataset

                ID        Age        Marks
count  1000.000000  1000.0000  1000.000000
mean    500.500000    20.9600    70.232000
std     288.819436     2.0036    17.468638
min       1.000000    18.0000    40.000000
25%     250.750000    19.0000    56.000000
50%     500.500000    21.0000    70.000000
75%     750.250000    23.0000    86.000000
max    1000.000000    24.0000   100.000000

In [7]:
df.min() #display minimum value of each column

ID                1
Name      Student_1
Age              18
Marks            40
Gender       Female
dtype: object

In [ ]:
df.max() #display maximum value of each column

ID               1000
Name      Student_999
Age                24
Marks             100
Gender           Male
dtype: object

In [9]:
df.mode() #display mode of each column

       ID          Name   Age  Marks  Gender
0       1     Student_1  18.0   65.0  Female
1       2    Student_10  21.0    NaN     NaN
2       3   Student_100   NaN    NaN     NaN
3       4  Student_1000   NaN    NaN     NaN
4       5   Student_101   NaN    NaN     NaN
..    ...           ...   ...    ...     ...
995   996   Student_995   NaN    NaN     NaN
996   997   Student_996   NaN    NaN     NaN
997   998   Student_997   NaN    NaN     NaN
998   999   Student_998   NaN    NaN     NaN
999  1000   Student_999   NaN    NaN     NaN

[1000 rows x 5 columns]

In [11]:
df.shape #display shape of the dataset

(1000, 5)

In [12]:
df.index #display index of the dataset

RangeIndex(start=0, stop=1000, step=1)

In [13]:
df.columns #display columns of the dataset

Index(['ID', 'Name', 'Age', 'Marks', 'Gender'], dtype='object')

In [14]:
df.dtypes #display data types of each column

ID         int64
Name      object
Age        int64
Marks      int64
Gender    object
dtype: object